Repository: devShaik010/kv-app
Catalog: lib/l10n/app_*.arb
Languages: te

# appTitle
source: Kisanverse
te: కిసాన్‌వర్స్

source: Home
te: హోమ్

source: Crops
te: పంటలు

source: Inventory
te: ఇన్వెంటరీ

source: Profile
te: ప్రొఫైల్

source: Fetching location...
te: స్థానం పొందుతోంది...

source: Fetching weather...
te: వాతావరణ సమాచారం పొందుతోంది...

# locationPermissionDenied
source: Location permission denied. Please enable in settings.
te: స్థానం అనుమతి తిరస్కరించబడింది. దయచేసి సెట్టింగ్స్‌లో ప్రారంభించండి.

source: Error getting location
te: స్థానం పొందడంలో లోపం

source: Unable to fetch weather
te: వాతావరణ సమాచారం పొందలేకపోయింది

source: Retry
te: మళ్లీ ప్రయత్నించండి

source: Manage your fields
te: మీ పొలాలను నిర్వహించండి

source: My Farm
te: నా పొలం

source: Balance
te: బ్యాలెన్స్

source: Humidity
te: తేమ

source: Soil Moisture
te: నేల తేమ

source: Precipitation
te: వర్షపాతం

source: Low
te: తక్కువ

source: Good
te: మంచిది

source: High
te: అధికం

source: Dry
te: పొడి

source: Wet
te: తడి

source: None
te: ఏదీ లేదు

source: Medium
te: మధ్యస్థం

source: Crops Management
te: పంటల నిర్వహణ

source: Manage your crops here
te: ఇక్కడ మీ పంటలను నిర్వహించండి

source: Track your inventory here
te: ఇక్కడ మీ ఇన్వెంటరీని ట్రాక్ చేయండి

# welcomeTitle
source: Welcome!
te: స్వాగతం!

# welcomeSubtitle
source: Let's start by knowing you better
te: మిమ్మల్ని బాగా తెలుసుకుందాం

source: Contact Information
te: సంప్రదింపు సమాచారం

# contactSubtitle
source: How can we reach you?
te: మేము మిమ్మల్ని ఎలా చేరుకోవచ్చు?

source: Farm Details
te: పొలం వివరాలు

# farmDetailsSubtitle
source: Tell us about your farm
te: మీ పొలం గురించి మాకు చెప్పండి

# stepOf
source: Step {current} of {total}
te: దశ {current} యొక్క {total}

source: Your Full Name
te: మీ పూర్తి పేరు

# namePlaceholder
source: e.g., John Doe
te: ఉదా., రాజేష్ కుమార్

source: Farm Name
te: పొలం పేరు

# farmNamePlaceholder
source: e.g., Oakdale Ranch
te: ఉదా., ఓక్‌డేల్ రాంచ్

source: Email Address
te: ఇమెయిల్ చిరునామా

# emailPlaceholder
source: e.g., farmer@example.com
te: ఉదా., farmer@example.com

source: Phone Number
te: ఫోన్ నంబర్

# phonePlaceholder
source: e.g., +1 234 567 8900
te: ఉదా., +91 98765 43210

source: Farm Location
te: పొలం స్థానం

# locationPlaceholder
source: e.g., Uppal Kalan, Telangana
te: ఉదా., ఉప్పల్ కలాన్, తెలంగాణ

source: Farm Size
te: పొలం పరిమాణం

# farmSizePlaceholder
source: e.g., 50 Acres
te: ఉదా., 50 ఎకరాలు

source: Years of Experience
te: అనుభవ సంవత్సరాలు

# experiencePlaceholder
source: e.g., 15 Years
te: ఉదా., 15 సంవత్సరాలు

source: Back
te: వెనుకకు

# continueButton
source: Continue
te: కొనసాగించు

source: Complete Setup
te: సెటప్ పూర్తి చేయండి

source: Please enter your name
te: దయచేసి మీ పేరు నమోదు చేయండి

# pleaseEnterFarmName
source: Please enter your farm name
te: దయచేసి పొలం పేరు నమోదు చేయండి

# pleaseEnterEmail
source: Please enter your email
te: దయచేసి మీ ఇమెయిల్ నమోదు చేయండి

# pleaseEnterValidEmail
source: Please enter a valid email
te: దయచేసి చెల్లుబాటు అయ్యే ఇమెయిల్ నమోదు చేయండి

# pleaseEnterPhone
source: Please enter your phone number
te: దయచేసి మీ ఫోన్ నంబర్ నమోదు చేయండి

# pleaseEnterLocation
source: Please enter your farm location
te: దయచేసి మీ పొలం స్థానం నమోదు చేయండి

# pleaseEnterFarmSize
source: Please enter your farm size
te: దయచేసి మీ పొలం పరిమాణం నమోదు చేయండి

# pleaseEnterExperience
source: Please enter your experience
te: దయచేసి మీ అనుభవం నమోదు చేయండి

# pleaseFillAllFields
source: Please fill all required fields
te: దయచేసి అవసరమైన అన్ని ఫీల్డ్‌లను పూరించండి

source: Email
te: ఇమెయిల్

source: Phone
te: ఫోన్

source: Location
te: స్థానం

source: Experience
te: అనుభవం

# notAvailable
source: N/A
te: అందుబాటులో లేదు

# nextGenFarming1
source: The next generation of farming 1
te: వ్యవసాయం యొక్క తదుపరి తరం 1

# nextGenFarming2
source: The next generation of farming 2
te: వ్యవసాయం యొక్క తదుపరి తరం 2

# nextGenFarming3
source: The next generation of farming 3
te: వ్యవసాయం యొక్క తదుపరి తరం 3

# nextGenFarming4
source: The next generation of farming 4
te: వ్యవసాయం యొక్క తదుపరి తరం 4

# farmingDescription
source: We provide data that enables the goals of global agriculture.
te: మేము ప్రపంచ వ్యవసాయ లక్ష్యాలను సాధ్యం చేసే డేటాను అందిస్తాము.

source: Get Started
te: ప్రారంభించండి

source: Language
te: భాష

source: Select Language
te: భాషను ఎంచుకోండి
